package homework;

public class hw_06_12_01 
{
	public static void main(String[] args) 
	{
		//성적관리에서 학생2명 데이타를 담을 변수선언
		//	-번호, 이름, 국어, 영어, 수학, 총점, 평균, 평점(A,B,C), 석차

		
		// 	학생 2명의 기본데이타(번호, 이름, 국어, 영어, 수학) 입력		
		int no1 = 1;				//번호
		int kor1 = 42;				//국어점수
		int eng1 = 56;				//영어점수
		int math1 = 78;				//수학점수
		int rank1 = 1;				//석차
		int total1;					//총점
		double avg1;				//평균
		char grade1;				//평점
		String name1 = "김경호";	//이름
		
		int no2 = 2;				//번호
		int kor2 = 43;				//국어점수
		int eng2 = 53;				//영어점수
		int math2 = 76;				//수학점수
		int rank2;					//석차
		int total2;					//총점
		double avg2;				//평균
		char grade2;				//평점
		String name2 = "김경수";	//이름
		
		//------------------------------------------------------------------------------------------------
		// 	학생 2명의 기본데이타(번호, 이름, 국어, 영어, 수학)를 이용해서 총점, 평균, 평점 계산후 대입
		total1 = kor1 + eng1 + math1;		//총점 1
		avg1 = total1 / 3.0;				//평균 1
		
		total2 = kor2 + eng2 + math2;		//총점 2
		avg2 = total2 / 3.0;				//평균 2
		//------------------------------------------------------------------------------------------------
		
		//순위 계산---------------------------------------------------------------------------------------
		if(total1 > total2)
		{
			rank1 = 1;
			rank2 = 2;
		}
		else
		{
			rank2 = 1;
			rank1 = 2;
		}
		//------------------------------------------------------------------------------------------------
		
		
		//1번 평점 계산-----------------------------------------------------------------------------------
		if(avg1 <= 100 && avg1 >= 0)
		{
			if(avg1 >= 90)
			{
				grade1 = 'A';
			} 
			else if(avg1 >= 80)
			{
				grade1 = 'B';
			}
			else if(avg1 >= 70)
			{
				grade1 = 'C';
			}
			else if(avg1 >= 60)
			{
				grade1 = 'D';
			}
			else 
			{
				grade1 = 'F';
			}
		}		
		else
		{
			System.out.println("ERROR: 유효하지 않은 점수입니다");	
			grade1 = '?';
		}
		
		//2번 평점 계산----------------------------------------------------------------------------------
		if(avg2 <= 100 && avg2 >= 0)
		{
			if(avg2 >= 90)
			{
				grade2 = 'A';
			} 
			else if(avg2 >= 80)
			{
				grade2 = 'B';
			}
			else if(avg2 >= 70)
			{
				grade2 = 'C';
			}
			else if(avg2 >= 60)
			{
				grade2 = 'D';
			}
			else 
			{
				grade2 = 'F';
			}
		}		
		else
		{
			System.out.println("ERROR: 유효하지 않은 점수입니다");	
			grade2 = '?';
		}
		
		////////////////////////////////     OUTPUT      ///////////////////////////////////////////////
		// 	학생 성적출력
		//
		//	---------------학생 성적출력-------------------
		//	학번  이름   국어 영어 수학 총점 평균 평점 석차
		// 	-----------------------------------------------
 	 	// 	 1  김경호    42   56   78  176  58.7   F    1
 	 	// 	 2  김경수    43   53   76  172  57.3   F    2	
		//	-----------------------------------------------
		//
		/////////////////////////////////////////////////////////////////////////////////////////////////
		
		System.out.printf("---------------학생 성적출력-------------------\n");
		System.out.printf("%s  %s   %s %s %s %s %s %s %s", "학번","이름","국어","영어","수학","총점","평균","평점","석차");
		System.out.println("\n-----------------------------------------------");
		System.out.printf("%2d  %-5s %3d %4d %4d %4d %5.1f %3c %4d", no1, name1, kor1, eng1, math1, total1, avg1, grade1, rank1);
		System.out.printf("\n%2d  %-5s %3d %4d %4d %4d %5.1f %3c %4d", no2, name2, kor2, eng2, math2, total2, avg2, grade2, rank2);
		System.out.println("\n-----------------------------------------------");
			
	}

}
